<%--<!DOCTYPE html>--%>
<%--<html>--%>

<%--<body>--%>

<%--<h2>Dear Employee, Please enter your Details  </h2>--%>

<%--<br>--%>
<%--<br>--%>
<%--&lt;%&ndash;// переход на новую строку биэр &ndash;%&gt;--%>
<%--&lt;%&ndash;тег форм, эйч ти ти пи метод этой формы гет&ndash;%&gt;--%>
<%--&lt;%&ndash;// экшен связан с кнопкой сабмит, показывает что произойдет при ее нажатии&ndash;%&gt;--%>
<%--&lt;%&ndash;произойдет переход по адресу шоудитейлс, переход по этому адресу перехватывает контроллер и указывает&ndash;%&gt;--%>
<%--&lt;%&ndash;какая вэб страница должна отобразится, нейм это имя поля формы ,&ndash;%&gt;--%>
<%--&lt;%&ndash;в которое мы вводим значение и оно будет хранить его как переменная&ndash;%&gt;--%>
<%--&lt;%&ndash;плейсхлдер это подсказка которая подсказывает что нужно вводить в поле &ndash;%&gt;--%>
<%--&lt;%&ndash;интуп тип сабмит спецальный тип который отображает кнопку &ndash;%&gt;--%>

<%--<form action="showDetails" method="get">--%>
<%--    <input type="text" name="employeeName"--%>
<%--    placeholder="Write your name"/>--%>

<%--    <input type="submit"/>--%>

<%--</form>--%>

<%--</body>--%>

<%--</html>--%>